docs/mediciones/perf/k6-04-cache-fria-jvm-caliente.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  00.3s/40.0s

running (0m02.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 01/20 VUs  01.3s/40.0s

running (0m03.0s), 01/20 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 01/20 VUs  02.3s/40.0s

running (0m04.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 02/20 VUs  03.3s/40.0s

running (0m05.0s), 02/20 VUs, 5 complete and 0 interrupted iterations
default   [  11% ] 02/20 VUs  04.3s/40.0s

running (0m06.0s), 03/20 VUs, 7 complete and 0 interrupted iterations
default   [  13% ] 03/20 VUs  05.3s/40.0s

running (0m07.0s), 03/20 VUs, 9 complete and 0 interrupted iterations
default   [  16% ] 03/20 VUs  06.3s/40.0s

running (0m08.0s), 03/20 VUs, 12 complete and 0 interrupted iterations
default   [  18% ] 03/20 VUs  07.3s/40.0s

running (0m09.0s), 04/20 VUs, 15 complete and 0 interrupted iterations
default   [  21% ] 04/20 VUs  08.3s/40.0s

running (0m10.0s), 04/20 VUs, 19 complete and 0 interrupted iterations
default   [  23% ] 04/20 VUs  09.3s/40.0s

running (0m11.0s), 05/20 VUs, 23 complete and 0 interrupted iterations
default   [  26% ] 05/20 VUs  10.3s/40.0s

running (0m12.0s), 06/20 VUs, 28 complete and 0 interrupted iterations
default   [  28% ] 06/20 VUs  11.3s/40.0s

running (0m13.0s), 06/20 VUs, 33 complete and 0 interrupted iterations
default   [  31% ] 06/20 VUs  12.3s/40.0s

running (0m14.0s), 07/20 VUs, 39 complete and 0 interrupted iterations
default   [  33% ] 07/20 VUs  13.3s/40.0s

running (0m15.0s), 08/20 VUs, 46 complete and 0 interrupted iterations
default   [  36% ] 08/20 VUs  14.3s/40.0s

running (0m16.0s), 09/20 VUs, 54 complete and 0 interrupted iterations
default   [  38% ] 09/20 VUs  15.3s/40.0s

running (0m17.0s), 09/20 VUs, 62 complete and 0 interrupted iterations
default   [  41% ] 09/20 VUs  16.3s/40.0s

running (0m18.0s), 10/20 VUs, 71 complete and 0 interrupted iterations
default   [  43% ] 10/20 VUs  17.3s/40.0s

running (0m19.0s), 11/20 VUs, 81 complete and 0 interrupted iterations
default   [  46% ] 11/20 VUs  18.3s/40.0s

running (0m20.0s), 12/20 VUs, 92 complete and 0 interrupted iterations
default   [  48% ] 12/20 VUs  19.3s/40.0s

running (0m21.0s), 12/20 VUs, 103 complete and 0 interrupted iterations
default   [  51% ] 12/20 VUs  20.3s/40.0s

running (0m22.0s), 13/20 VUs, 115 complete and 0 interrupted iterations
default   [  53% ] 13/20 VUs  21.3s/40.0s

running (0m23.0s), 14/20 VUs, 128 complete and 0 interrupted iterations
default   [  56% ] 14/20 VUs  22.3s/40.0s

running (0m24.0s), 15/20 VUs, 142 complete and 0 interrupted iterations
default   [  58% ] 15/20 VUs  23.3s/40.0s

running (0m25.0s), 15/20 VUs, 156 complete and 0 interrupted iterations
default   [  61% ] 15/20 VUs  24.3s/40.0s

running (0m26.0s), 16/20 VUs, 171 complete and 0 interrupted iterations
default   [  63% ] 16/20 VUs  25.3s/40.0s

running (0m27.0s), 17/20 VUs, 187 complete and 0 interrupted iterations
default   [  66% ] 17/20 VUs  26.3s/40.0s

running (0m28.0s), 18/20 VUs, 204 complete and 0 interrupted iterations
default   [  68% ] 18/20 VUs  27.3s/40.0s

running (0m29.0s), 18/20 VUs, 221 complete and 0 interrupted iterations
default   [  71% ] 18/20 VUs  28.3s/40.0s

running (0m30.0s), 19/20 VUs, 238 complete and 0 interrupted iterations
default   [  73% ] 19/20 VUs  29.3s/40.0s

running (0m31.0s), 20/20 VUs, 257 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  30.3s/40.0s

running (0m32.0s), 19/20 VUs, 277 complete and 0 interrupted iterations
default   [  78% ] 19/20 VUs  31.3s/40.0s

running (0m33.0s), 17/20 VUs, 296 complete and 0 interrupted iterations
default   [  81% ] 17/20 VUs  32.3s/40.0s

running (0m34.0s), 15/20 VUs, 313 complete and 0 interrupted iterations
default   [  83% ] 15/20 VUs  33.3s/40.0s

running (0m35.0s), 13/20 VUs, 328 complete and 0 interrupted iterations
default   [  86% ] 13/20 VUs  34.3s/40.0s

running (0m36.0s), 10/20 VUs, 341 complete and 0 interrupted iterations
default   [  88% ] 10/20 VUs  35.3s/40.0s

running (0m37.0s), 09/20 VUs, 351 complete and 0 interrupted iterations
default   [  91% ] 09/20 VUs  36.3s/40.0s

running (0m38.0s), 07/20 VUs, 359 complete and 0 interrupted iterations
default   [  93% ] 07/20 VUs  37.3s/40.0s

running (0m39.0s), 05/20 VUs, 366 complete and 0 interrupted iterations
default   [  96% ] 05/20 VUs  38.3s/40.0s

running (0m40.0s), 03/20 VUs, 371 complete and 0 interrupted iterations
default   [  98% ] 03/20 VUs  39.3s/40.0s

running (0m41.0s), 01/20 VUs, 374 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/20 VUs  40s


  █ THRESHOLDS 

    catalogo_duracion
    ✓ 'p(95)<200' p(95)=26.41ms

    catalogo_errores
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 750     18.124795/s
    checks_succeeded...: 100.00% 750 out of 750
    checks_failed......: 0.00%   0 out of 750

    ✓ catálogo responde 200
    ✓ catálogo devuelve contenido

    CUSTOM
    catalogo_duracion..............: avg=12.66ms min=4.92ms med=9.4ms max=228.27ms p(90)=20.9ms  p(95)=26.41ms
    catalogo_errores...............: 0.00%  0 out of 375

    HTTP
    http_req_duration..............: avg=14.28ms min=4.92ms med=9.4ms max=618.92ms p(90)=20.93ms p(95)=26.94ms
      { expected_response:true }...: avg=14.28ms min=4.92ms med=9.4ms max=618.92ms p(90)=20.93ms p(95)=26.94ms
    http_req_failed................: 0.00%  0 out of 376
    http_reqs......................: 376    9.086564/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=1s     med=1.01s max=1.23s    p(90)=1.02s   p(95)=1.02s  
    iterations.....................: 375    9.062397/s
    vus............................: 1      min=1        max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 1.5 MB 36 kB/s
    data_sent......................: 178 kB 4.3 kB/s



running (0m41.4s), 00/20 VUs, 375 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  40s